/**
# BY 阿赛
# 用法
<script src="js/gg-say.js"></script>
<script>
document.write(ggSay); // say show
</script>
**/
var asaitit = new Array(
    "健康快乐",
    "万事如意",
    "吉祥如意",
    "大吉大利",
    "恭喜發財",
    "恭喜发财",
    "财源广进",
    "力争上游",
    "知足常乐",
    "有志竟成",
    "人定胜天",
    "人生在勤",
    "宁静致远",
    "天天开心",
    "智树",
    "阿莲",
    "阿赛",
    "游梦鱼",
    "行动是成功的阶梯，行动越多，登得越高。",
    "只有不断找寻机会的人才会及时把握机会。",
    "有志者能使石头长出青草来。",
    "死犹未肯输心去，贫亦其能奈我何！",
    "穷不一定思变，应该是思富思变。",
    "决心是成功的开始。",
    "别人的话只能作为一种参考，是不能左右自己的。",
    "生命太过短暂，今天放弃了明天不一定能得到。",
    "与其当一辈子乌鸦，莫如当一次鹰。",
    "先知三日，富贵十年。",
    "脚下的路还很长，活着就要坚决走下去。",
    "天才是百分之一的灵感加上百分之九十九的努力。",
    "成功者绝不放弃。",
    "人格的完善是本，财富的确立是末。",
    "自己选择的路跪着也要把它走完。",
    "生活不是等待风暴过去，而是学会在雨中翩翩起舞",
    "有志始知蓬莱近，无为总觉咫尺远。",
    "成功者绝不给自己软弱的借口。",
    "一念放下，万般自在。",
    "只有第一名可以教你如何成为第一名。",
    "胸有凌云志，无高不可攀。",
    "人的价值，在遭受诱惑的一瞬间被决定。",
    "人生最大的失败，就是放弃。",
    "因害怕失败而不敢放手一搏，永远不会成功。",
    "大丈夫处世，不能立功建业，几与草木同腐乎？",
    "人生不得行胸怀，虽寿百岁犹为无也。",
    "挫折其实就是迈向成功所应缴的学费。",
    "无所求则无所获。励志短语正能量",
    "有志不在年高，无志空活百岁。",
    "你只有一定要，才一定会得到。",
    "不要等待机会，而要创造机会。",
    "人总是珍惜未得到的，而遗忘了所拥有的。",
    "没有伞的孩子必须努力奔跑！",
    "对的，坚持；错的，放弃！",
    "笑口常开，好彩自然来！",
    "相互了解是朋友，相互理解是知己。",
    "善待他人，体谅他人，热爱生命，努力生活。",
    "靠山山会倒，靠水水会流，靠自己永远不倒。",
    "尽自己最大的努力，抱最大的希望，作最坏的打算",
    "有多大的思想，才有多大的能量。",
    "并非神仙才能烧陶器，有志的人总可以学得精手艺",
    "忍耐力较诸脑力，尤胜一筹。",
    "贪婪是最真实的贫穷，满足是最真实的财富。",
    "九十九次的理论不如一次的行动来得实际。",
    "有时可能别人不在乎你，但你不能不在乎自己。",
    "丈夫四海志，万里犹比邻。",
    "欲望以提升热忱，毅力以磨平高山。",
    "人若有志，万事可为。最新励志短语正能量",
    "人无志向，和迷途的盲人一样。",
    "在逆境中，智者知难而进，愚者消沉不前。",
    "志正则众邪不生。",
    "自己打败自己的远远多于比别人打败的。",
    "没有灯的小路一样可以行走，只要心还在。",
    "有目标的人生才有方向有规划的人生才更精彩。",
    "回避现实的人，未来将更不理想。",
    "完全照成功者的方法来执行。",
    "人之所以异于禽者，唯志而已矣！",
    "人只要不失去方向，就不会失去自己。",
    "人生重要的不是所站的位置，而是所朝的方向。",
    "燕雀安知鸿鹄之志哉。",
    "当你不再期待得到什么东西的时候，你会得到一切",
    "你必须成功，因为你不能失败。",
    "丈夫清万里，谁能扫一室。",
    "旁观者的姓名永远爬不到比赛的计分板上。",
    "只要努力抬起你的双脚，胜利将属于你。",
    "用爱心来做事，用感恩的心做人。",
    "世上没有绝望的处境，只有对处境绝望的人。",
    "鹰爱高飞，鸦栖一枝。",
    "没有口水与汗水，就没有成功的泪水。",
    "要克服生活的焦虑和沮丧，得先学会做自己的主人",
    "青春一经典当即永不再赎。",
    "只要有信心，人永远不会挫败。",
    "一滴蜂蜜比一加仑胆汁能够捕到更多的苍蝇。",
    "志气和贫困是患难兄弟，世人常见他们伴在一起。",
    "成功等于目标，其他都是这句话的注解。",
    "心志要坚，意趣要乐。",
    "牢记所得到的，忘记所付出的。",
    "顶天立地奇男子，要把乾坤扭转来。",
    "年轻是我们唯一拥有权利去编织梦想的时光。",
    "积极思考造成积极人生，消极思考造成消极人生。",
    "我走得很慢，但我从不后退！"
);

var asaiarr = asaitit[Math.floor(Math.random() * asaitit.length)].split('');

function RandomFontColor(type) {
    var str = "1234567890a";
    if (type === 0) {
        str = "bcdef";
    }
    var t = "#";
    for (var j = 0; j < 6; j++) {
        t = t + str.charAt(Math.random() * str.length);
    }
    return t;
}

var ggSay = '<style>.gg-say{border-radius:50%;padding:2px 6px;}</style>“';
for (j = 0, len = asaiarr.length; j < len; j++) {
    ggSay += '<span class="gg-say" style="color:' + RandomFontColor(1) + ';background-color:' + RandomFontColor(0) + ';">' + asaiarr[j] + '</span>';
}
ggSay += '”';