var zpData = [
  {
    tit: "华为PPS广告投放系统",
    des: "(外协)基于angular的投放端和基于vue的管理端，采用typescript开发，涉及大量数据处理逻辑与数据导入导出，以及数据图表渲染等前端能力。",
  },
  {
    tit: "华为创意广告设计平台",
    des: "(外协)熟练运用vue/es6/axios/webpack等技术部署开发与发布环境，制作在线版图片、H5页面编辑器。",
  },
  {
    tit: "华为主题开发工具",
    des: "(外协)基于electron/vue/nodejs架设开发环境，涉及H5/CSS3/JS/ES6/VUE/NODEJS/ELECTRON/WEBPACK/SVG/CANVAS/ANIMATION/SASS/LESS等技术开发win/Mac全端全球适配的IDE。",
  },
  {
    tit: "车商记",
    des: "二手车车商记账本，基于uni-app安卓、苹果APP开发。",
  },
  {
    tit: "机电牛",
    des: "平台的架构、数据库、WEB前端设计、程序开发、上线等，独立完成全部工作。机电牛jidianniu.com是国内首家专业专用车服务平台，含车型数据中心、配套商城、租赁服务、专用车论坛、国家专用车公告查询等项目。",
  },
  {
    tit: "生易网",
    des: "生物医药科技B2B平台，需求分析、网站架构、设计开发、上线运营与维护等全部工作",
  },
  {
    tit: "中国设备联盟",
    des: "生产设备B2B平台，带队完成旗下十二个网站的改版、重新架构、平台维护与运营工作。中国最大、最专业、信息量最大的设备B2B网站",
  },
  {
    tit: "中国船舶设备网",
    des: "设备联盟旗下专业的船舶设备网",
  },
  {
    tit: "中国石油物资网",
    des: "设备联盟旗下专业的石油物资设备网站",
  },
  {
    tit: "化工设备网",
    des: "设备联盟旗下专业的化工设备网",
  },
  {
    tit: "中国物流设备网",
    des: "设备联盟旗下专业的物流设备配套网站",
  },
  {
    tit: "中国电力设备网",
    des: "设备联盟旗下专业的电力设备网",
  },
  {
    tit: "制药设备网",
    des: "设备联盟旗下专业的制药设备网",
  },
  {
    tit: "食品设备网",
    des: "设备联盟旗下专业的食品设备配套",
  },
  {
    tit: "中国冶金设备网",
    des: "设备联盟旗下专业的冶金制造设备网",
  },
  {
    tit: "中国水处理设备网",
    des: "设备联盟旗下专业的水处理设备网站",
  },
  {
    tit: "环保设备网",
    des: "设备联盟旗下专业的环保设备网",
  },
  {
    tit: "中国纺织设备网",
    des: "设备联盟旗下专业的纺织设备网站",
  },
  {
    tit: "中国矿产设备网",
    des: "设备联盟旗下专业的矿产设备网站",
  },
  {
    tit: "设备通会员网站",
    des: "制作各网站的会员网站系统，超阿里巴巴的自主建站系统。",
  },
  {
    tit: "南京搜浪互联",
    des: "专业互联网技术公司",
  },
  {
    tit: "车疯子、铁锤车检",
    des: "市场调研、需求分析、网站架构，并独立完成网站设计与开发",
  },
  {
    tit: "新南京",
    des: "通过市场分析定位门户网站方向，完成网站WEB前端与后台程序设计。新南京的任务是聚合本地1990年至今的所有公开、公共信息，以便大家查阅，我们坚持对每条信息进行严格审核确认，并对外发布，部分信息转载自本地权威网站，如政府、机构、协会、学校等，本着不侵权、不外泄私密信息，不公开有违国家法律的任何信息。",
  },
  {
    tit: "绮思爱",
    des: "通过调研、出需求说明最终确认项目开发架构方案，独立制作完成所有模块",
  },
  {
    tit: "南京二手车网、新车网、租车网",
    des: "负责旧站改版，并完成新车网、租车网及其他特需项目",
  },
  {
    tit: "搜车网——新车站",
    des: "旗下的新车网",
  },
  {
    tit: "搜车网——二手车站",
    des: "当时南京地区知名二手车网站",
  },
  {
    tit: "新车团购站",
    des: "南京本地最专业的新车团购网包含资讯、新车报价、团购等",
  },
  {
    tit: "租车网",
    des: "中国第一家私人租车网站",
  },
  {
    tit: "搜车买卖通",
    des: "搜车网二手车车商的网店",
  },
  {
    tit: "新车4S网店",
    des: "搜车网新车4S店的网店",
  },
  {
    tit: "新车报价网",
    des: "搜车网新车报价系统，结合新车图库",
  },
  {
    tit: "病毒式营销系统",
    des: "为公司设计病毒式网站营销系统",
  },
  {
    tit: "SMD资讯网",
    des: "到南京后的第一个网站项目，一个专业的SMD资讯门户网，与技术经理合作共同完成网站建设",
  },
  {
    tit: "阿赛网站系统",
    des: "阿赛网站系统以阿赛企业网站系统为蓝本，专为企业网站建设开设多种易改易用的功能，可以快速搭建成熟的企业网站、行业网站等。",
  },
  {
    tit: "阿赛企业网站系统",
    des: "阿赛企业网站系统从2005年着手开发，自发布第一版以来，深受网友喜爱，是迄今企业建站最受欢迎的ASP开源系统，如今已经发布到第十九版，功能更完善、运行更稳定、更安全。",
  },
  {
    tit: "阿赛门户网站系统",
    des: "阿赛门户网站系统为开源系统，对外分享期间得到大批网友认可，全站源码均原创架构设计，各套系统中可以自由组合搭配，提供完全自定义方式建站，前后台完全分离，功能丰富强大。",
  },
  {
    tit: "阿赛个人主页",
    des: "设计精美的原创个人网站程序，纯设计类的个人网站系统，采用当时很流行的小清新配色，全站设计协调，程序严谨，深受网友赞誉的一套早期系统。",
  },
  {
    tit: "阿赛树形论坛",
    des: "生成HTML的个性树形论坛，提供大树（无限分支看帖、回帖模式）、小树（两层看帖、发帖模式）两种，多应用彩票、快捷信息交换平台，共计发布了五个版本，每个版本各不相同，满足不同客户需求。",
  },
  {
    tit: "阿赛无数据库简易留言本",
    des: "无数据库采用FSO直接储存留言，第一次将数据库存储媒介罢用，采用全新的缓存、txt及其他文本类文件储存信息。",
  },
  {
    tit: "阿赛文章系统",
    des: "安全实用的生成HTML文章系统，全站HTML生成，全静态访问，适用于各类独立自媒体网站系统。",
  },
  {
    tit: "阿赛问吧",
    des: "功能媲敌百度问吧，以临摹为主，代码为原创架构，更简洁的流程与程序设计完成强大的百度问吧功能。",
  },
  {
    tit: "阿赛单文件表单提交-处理系统",
    des: "实用的表单提交系统，用来采集用户信息，或投票结果、用户意向调查等。",
  },
  {
    tit: "阿赛订单系统",
    des: "实用的订单系统，开发出独立的订单处理接口，可以对接入不同的建站系统之中，也可以独立用来礼物发放、商品出售活动。",
  },
  {
    tit: "阿赛在线HTML编辑器",
    des: "漂亮、简单实用的在线HTML编辑器，纯JS实现，运行速度极快，兼容所有老旧或新款浏览器。",
  },
  {
    tit: "南京教育网",
    des: "新南京旗下致力于南京本土的专业教育网",
  },
  {
    tit: "南京游玩网",
    des: "新南京旗下致力于南京本土的旅游、吃喝玩乐住行网",
  },
  {
    tit: "旗旗芽个人网站",
    des: "精美设计的个人网站系统",
  },
  {
    tit: "爱课驿",
    des: "项目组开发的大型教学资源入库搜索网",
  },
  {
    tit: "教师论坛",
    des: "项目组开发的优秀多功能互动论坛",
  },
  {
    tit: "芳涯论坛",
    des: "原创的UBB代码，大型互动交友论坛",
  },
  {
    tit: "大型互动社区",
    des: "由“乔客”改版的大型门户型网站系统，为企业第三方定制版本",
  },
  {
    tit: "TXT网络日记本",
    des: "简约的以普通的TXT文本文件为数据库的网站程序",
  },
  {
    tit: "EXCEL文章系统",
    des: "单个文件实现的以EXCEL为数据库的文章系统",
  },
  {
    tit: "小草涯",
    des: "早期运营的一个交友类型粉色系网站，功能强大，最好的时候日均访问过万，成功配对数千对新人。",
  },
  {
    tit: "一百字",
    des: "个性化的一百字系统，通过顶、降功能挑出年度最佳一百字，由此系统衍生的顶、降功能一直被很多大型网站和互动社区袭用至今。",
  },
  {
    tit: "网上考试系统",
    des: "共经历4个版本，针对学校在线网络考试创设的大型考试系统",
  },
  {
    tit: "阿赛博客",
    des: "早期的一个简单博客系统，注重设计，功能简约而不简单",
  },
  {
    tit: "阿赛工作室",
    des: "出品各类企业、行业、门户建站系统，对ASP精益求精的探索，不断革新各种技术和网页实现模式。",
  },
  {
    tit: "阿赛工作室 FLASH版",
    des: "一套纯FLASH版的个人网站系统",
  },
  {
    tit: "江苏省泗洪县上塘中学",
    des: "2005-2007年共做了4个版本，先后获得多个网站制作奖项",
  },
  {
    tit: "宋校长留言板",
    des: "一款为高层管理人员量身定做的留言系统",
  },
  {
    tit: "植物生理学多媒体课程",
    des: "容各类教学功能与一体，集成聊天系统、考试系统、论坛、留言、文章、图片、下载、视频等",
  },
  {
    tit: "阿赛大型门户社区网站系统",
    des: "阿赛大型门户社区网站系统是一套全新架构的地方门户网站系统，包罗文章、图片、下载、视频、音乐、博客、论坛、sns社交、聊天、短信、商城、供求系统等。",
  },
];

var zpDom =
  '<style>.zp-ol ol{text-align:left;word-wrap:break-word;list-style:none;padding: 0px;margin: 0px;}.zp-ol ol{counter-reset: show-list;}.zp-ol ol li{padding-left: 30px;position: relative;counter-increment: item;}.zp-ol ol li:before{content: ""counter(item)". ";display: block;position: absolute;left: 0;top:0;}</style><div class="zp-ol"><ol>';
var zpDataLen = zpData.length;
var zpi = 0;
var zpItem;
while (zpi < zpDataLen) {
  zpItem = zpData[zpi];
  if (zpItem.des) {
    zpDom += "<li><b>" + zpItem.tit + "</b>：" + zpItem.des + "</li>";
  } else {
    zpDom += "<li><b>" + zpItem.tit + "</b></li>";
  }
  zpi++;
}
zpDom += "</ol></div>";

document.write(zpDom);
